export default {
	api_base_url : 'http://localhost:3000/',
	// api_base_url : 'httpz://hello-cloudbase-0g324hb6bc21523c-1307223249.ap-shanghai.app.tcloudbase.com',
  ErrorMesage:{
    400:'网络请求失败！'
  },
  Authentication:false,//是否开启全域访问鉴权
	sanGuo:{
		"曹魏":{
			"文臣":['荀彧','荀攸','贾诩','郭嘉','程昱','戏志才','刘晔','蒋济','陈群','华歆','钟繇','满宠','董昭','王朗','崔琰','毛玠','杜畿','田畴','王修','杨修','辛毗','杨阜','田豫','王粲','蒯越','张继','杜袭','枣祗','任峻','陈矫','郗虑','桓玠','丁仪','丁廙','司马朗','韩暨','韦康','邴原','赵俨','娄圭','贾逵','陈琳','司马懿'],
			"武将":['张辽','徐晃','夏侯惇','夏侯渊','庞德','张郃','李典','乐进','典韦','曹洪','曹仁','曹彰','曹纯','于禁','许褚','吕虔','李通','文聘','臧霸','郭淮','钟会','邓艾','曹休','张燕','张绣','朱灵','路昭','史涣','韩浩','王凌','孙礼','秦朗','郑文','夏侯尚','毌丘俭','诸葛诞']
		},
		"蜀汉":{
			"文臣":['孙乾','简雍','糜竺','糜芳','庞统','法正','许靖','马良','徐庶','陈震','杨仪','费祎','蒋琬','孟优','黄皓','诸葛亮'],
			"武将":['关羽','张飞','马超','黄忠','赵云','魏延','关平','周仓','关兴','张苞','陈到','李严','姜维','廖化','马谡','马岱','陈式','雷铜','吴兰','王平','任夔','张翼','马忠','张南','冯习','傅佥','关索']
		},
		"孙吴":{
			"文臣":['陆逊','张昭','张紘','鲁肃','虞翻','顾雍','诸葛谨','诸葛恪','陆凯','骆统','周鲂'],
			'武将':['周瑜','吕蒙','甘宁','太史慈','程普','黄盖','韩当','周泰','蒋钦','丁奉','徐盛','陈武','凌操','凌统','潘璋','朱然','孙桓','马忠','孙韶','朱桓','夏恂','周平','全琮','于诠']
		}
	}

}
// 首页每页数量
export const HOME_LIMIT = 2